<template>
  <div class="comments container">
    Ввиду того, что информацию о корабле показываю в модалке, то роутер как таковой не нужен, поэтому решил оставить вторую страницу
    для своих комментариев по этой работе. Касаемо Vuex'a - изначально делал несколько однофайловых компонентов (table, pagination),
    поэтому данные о кораблях хранил внутри Vuex, однако впоследствии найдя готовый компонент на Bootstrap Vue c уже имеющейся таблицей
    и паджинацией, решил хранить инфу о кораблях в экземпляре Table, используя Vuex только для истории просмотров, как было сказано,
    в задаче. Собственно, историю просмотров засунул под паджинацию, надеюсь, что большого это значения не имеет, все-таки дизайн
    и компоновка элементов на странице в задаче не оговаривались. Также для сборки использовал Vue-cli, в требованиях к задаче не указанный.
  </div>
</template>
